### Terraform Plan
```
data.aws_ami.ubuntu: Reading...
aws_key_pair.kubestock: Refreshing state... [id=kubestock-key]
aws_iam_policy.k8s_controllers: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-controllers-policy]
aws_vpc.kubestock_vpc: Refreshing state... [id=vpc-0a65a6bd6be2223dc]
aws_iam_role.k8s_nodes: Refreshing state... [id=kubestock-node-role]
aws_iam_role_policy_attachment.k8s_nodes_ssm: Refreshing state... [id=kubestock-node-role-20251122171458069900000001]
aws_iam_role_policy_attachment.k8s_controllers: Refreshing state... [id=kubestock-node-role-20251122171458070500000002]
aws_iam_instance_profile.k8s_nodes: Refreshing state... [id=kubestock-node-profile]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0ade68f094cc81635]
aws_subnet.private[1]: Refreshing state... [id=subnet-0537648f14b08fae9]
aws_internet_gateway.igw: Refreshing state... [id=igw-01f445518c285bb47]
aws_subnet.public[1]: Refreshing state... [id=subnet-0559dfc1c9f2ba26d]
aws_subnet.public[0]: Refreshing state... [id=subnet-01240ef2e0b751289]
aws_subnet.private[0]: Refreshing state... [id=subnet-0b1dc7ca3ea5b0331]
aws_subnet.public[2]: Refreshing state... [id=subnet-0577be992dc0ab111]
aws_subnet.private[2]: Refreshing state... [id=subnet-0780d8e640722a270]
aws_security_group.bastion: Refreshing state... [id=sg-0b8af5ccdc9c1d59a]
aws_security_group.k8s_common: Refreshing state... [id=sg-0b067e3fb603b11be]
aws_lb_target_group.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b]
aws_security_group.dev_server: Refreshing state... [id=sg-0d67ff044a38749c1]
aws_eip.nat: Refreshing state... [id=eipalloc-0343d1d2c3192b117]
aws_route_table.public: Refreshing state... [id=rtb-05c13f4e14ae0919a]
aws_security_group.workers: Refreshing state... [id=sg-08b85cb7308f90c2f]
aws_security_group.nlb_api: Refreshing state... [id=sg-0b0d4dba43b6333e3]
aws_instance.dev_server: Refreshing state... [id=i-08c6d4bdb5a49427a]
aws_instance.bastion: Refreshing state... [id=i-00f0ca79b9ce4c42b]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-032368bbbbdbffa70]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0382b6c798e2559df]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-072cb499e6ec152fc]
aws_instance.worker[0]: Refreshing state... [id=i-02da5fbb7601a5051]
aws_instance.worker[1]: Refreshing state... [id=i-052306a1c9c1ec97e]
aws_security_group.control_plane: Refreshing state... [id=sg-0ac3836e0f42135fb]
aws_lb.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb-api/9f36c11b9d916d59]
aws_nat_gateway.nat: Refreshing state... [id=nat-054ea26583c09fb63]
aws_route_table.private[0]: Refreshing state... [id=rtb-06f165d277305b4f2]
aws_route_table.private[2]: Refreshing state... [id=rtb-04b01b74ef23587e6]
aws_route_table.private[1]: Refreshing state... [id=rtb-0b5da2e36e8f81b57]
aws_instance.control_plane: Refreshing state... [id=i-08ff658102a4848d6]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05cd7e585640a44e2]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0861217d4449ff33d]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0899b49bc97142ad1]
aws_lb_listener.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb-api/9f36c11b9d916d59/7ba42e9873ca8f56]
aws_eip.bastion: Refreshing state... [id=eipalloc-0e7b598a9492e3186]
aws_lb_target_group_attachment.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b-2025112217153294790000000a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.dev_server will be updated in-place
  ~ resource "aws_instance" "dev_server" {
        id                                   = "i-08c6d4bdb5a49427a"
      ~ public_dns                           = "ec2-13-233-92-66.ap-south-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.233.92.66" -> (known after apply)
        tags                                 = {
            "Name" = "kubestock-dev-server"
            "Role" = "development"
        }
      ~ user_data                            = "0a78962d6aa8e907c7fe8079e66e95a86773f3b9" -> "2186c6d5d7446ccda737796bb75d7f48bc8d2e0e"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.worker[0] will be updated in-place
  ~ resource "aws_instance" "worker" {
        id                                   = "i-02da5fbb7601a5051"
        tags                                 = {
            "Name"                            = "kubestock-worker-1"
            "Role"                            = "worker"
            "kubernetes.io/cluster/kubestock" = "owned"
        }
      ~ user_data                            = "0603c9cbc582527797a685311c00ad72ee7ffe9f" -> "b575384c76b00da7d29fd33bae6ec7a9190d2fed"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.worker[1] will be updated in-place
  ~ resource "aws_instance" "worker" {
        id                                   = "i-052306a1c9c1ec97e"
        tags                                 = {
            "Name"                            = "kubestock-worker-2"
            "Role"                            = "worker"
            "kubernetes.io/cluster/kubestock" = "owned"
        }
      ~ user_data                            = "0603c9cbc582527797a685311c00ad72ee7ffe9f" -> "b575384c76b00da7d29fd33bae6ec7a9190d2fed"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ dev_server_public_ip           = "13.233.92.66" -> (known after apply)
  ~ dev_server_ssh_command         = "ssh -i ~/.ssh/kubestock-key ubuntu@13.233.92.66" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```